# Task 4.6 - Combining & Exporting Data

### Table of Contents

1. Importing Libraries and data
2. Combining instacart orders and product data
3. Exporting merged dataframe

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

#### 1. Importing Instacart combined orders & products dataframe

In [2]:
# identifying project path
project =r'D:\Adam\Employment\Data Analysis Course\Python Instacart project'

# Import Instacart prepared orders data
df_ords = pd.read_pickle(os.path.join(project, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

In [3]:
df_ords.shape

(32434489, 11)

In [4]:
df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,new_customer,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,both
1,2539329,1,1,2,8,NaN,True,14084,2,0,both
2,2539329,1,1,2,8,NaN,True,12427,3,0,both
3,2539329,1,1,2,8,NaN,True,26088,4,0,both
4,2539329,1,1,2,8,NaN,True,26405,5,0,both

In [5]:
# same shape, same data in head

In [6]:
df_ords.drop(columns=['_merge'], inplace=True)

In [7]:
df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,new_customer,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,True,196,1,0
1,2539329,1,1,2,8,NaN,True,14084,2,0
2,2539329,1,1,2,8,NaN,True,12427,3,0
3,2539329,1,1,2,8,NaN,True,26088,4,0
4,2539329,1,1,2,8,NaN,True,26405,5,0

In [8]:
# Import Instacart prepared products data

df_prods = pd.read_csv(os.path.join(project, '02 Data', 'Prepared Data', 'products_checked.csv'))

In [9]:
df_prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [10]:
df_prods.drop(columns=['Unnamed: 0'], inplace=True)

In [11]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

#### 2. Combining Instacart orders data with products data

In [12]:
df_merged_orders = df_ords.merge(df_prods, on = 'product_id', indicator = True)

In [13]:
df_merged_orders.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,new_customer,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,False,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,False,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,False,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,False,196,1,1,Soda,77,7,9.0,both

In [14]:
df_merged_orders['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [15]:
df_merged_orders.shape

(32404859, 15)

In [17]:
df_merged_orders_test = df_ords.merge(df_prods, on = 'product_id', how = 'outer', indicator = True)

In [18]:
df_merged_orders_test['_merge'].value_counts()

both          32404859
left_only        30200
right_only          11
Name: _merge, dtype: int64

In [20]:
# Interesting that 30,200 of the orders don't have product_ids that show up in the product catalog
# and there are 11 products in the product catalog that don't get ordered in the 32 million products ordered

#### 3. Exporting merged products and orders dataframe

In [21]:
# Export data to pkl

df_merged_orders.to_pickle(os.path.join(project, '02 Data','Prepared Data', 'orders_products_merged.pkl'))